Repository: adslbarxatov/ConcurrentDraw
Catalog: src/ConcurrentDraw_*.resx
Languages: ru_ru

# BASS_ERROR_BUSY
source: Requested device is busy or in use by another application
ru_ru: Запрошенное устройство занято или используется другим приложением

# BASS_ERROR_CODEC
source: File {0:S} is unsupported
ru_ru: Формат файла {0:S} не поддерживается

# BASS_ERROR_DEVICE
source: Requested device is invalid or incompatible
ru_ru: Запрошенное устройство не существует или не поддерживается

# BASS_ERROR_DRIVER
source: No compatible driver found for requested device
ru_ru: Не найден подходящий драйвер для запрошенного устройства

# BASS_ERROR_DX
source: A sufficient version of DirectX is not installed
ru_ru: В системе отсутствует подходящая версия DirectX

# BASS_ERROR_FILEOPEN
source: File {0:S} is unavailable
ru_ru: Файл {0:S} не найден или недоступен

# BASS_ERROR_FORMAT
source: Specified device doesn't support required audio mode
ru_ru: Запрошенное устройство не поддерживает требуемый аудиорежим

# BASS_ERROR_MEM
source: Not enough memory
ru_ru: Недостаточно оперативной памяти

# BASS_ERROR_NOTAVAIL
source: Requested device is unavailable
ru_ru: Запрошенное устройство недоступно

# CDP_Name
source: parameters
ru_ru: параметры

# GenericTab_AlwaysOnTopFlag
source: Always on top
ru_ru: Поверх всех окон

# CDP_BDSettingsText
source: Beats detection range: {0:D} – {1:D} Hz Amplitude threshold: {2:D}%
ru_ru: Диапазон детекции бито́в: {0:D} – {1:D} Гц Порог амплитуды: {2:D}%

# MainTabControl_BeatsTab
source: Beats detection
ru_ru: Детектор бито́в

# CDP_CENo
source: No cumulative effect
ru_ru: Без кумулятивного эффекта

# CDP_CESettingsText
source: Cumulation speed: {0:S} Fade out speed multiplier: {1:S}
ru_ru: Скорость накопления: {0:S} Множитель скорости ослабления: {1:S}

# MainTabControl_CumulationTab
source: Cumulative effect
ru_ru: Кумулятивный эффект

# GenericTab_DevicesLabel
source: Output device:
ru_ru: Устройство:

# HistoTab_HGRangeLabel
source: Histogram range:
ru_ru: Диапазон гистограммы:

# HistoTab_HzLabelText
source: 0 – {0:D} Hz
ru_ru: 0 – {0:D} Гц

# ConcurrentDrawParameters_LanguageLabel
source: Language:
ru_ru: Язык:

# CDP_NoDevices
source: (no compatible devices)
ru_ru: (нет подходящих устройств)

# GenericTab_PaletteLabel
source: Palette:
ru_ru: Палитра:

# HistoTab_SGHeightLabel
source: Height:
ru_ru: Высота:

# GenericTab_VisLeftTopLabel
source: Visualization left-top:
ru_ru: Позиция окна:

# GenericTab_VisSizeLabel
source: Visualization size:
ru_ru: Размер окна:

# GenericTab_VisTypeLabel
source: Visualization type:
ru_ru: Тип визуализации:

# DeviceBehaviorIsInvalid
source: Requested device cannot be initialized. Try to set another one
ru_ru: Запрошенное устройство в настоящий момент не может быть использовано. Попробуйте выбрать другое устройство

# NoCompatibleDevices
source: No compatible audio output devices found on your system
ru_ru: В системе отсутствуют совместимые устройства аудиовывода

# LogoTab_LogoHeightLabel
source: Height: Placement:
ru_ru: Высота: Позиция:

# HistoTab_HistoRotAccToBeats
source: Rotation according to beats detector with angle impulse:
ru_ru: Вращение в соответствии с бит-детектором при импульсе:

# MainTabControl_HistoTab
source: Spectrogram / histogram
ru_ru: Спектрограммы / гистограммы

# HistoTab_HistoRotSpeed
source: Rotation with constant angle increment:
ru_ru: Вращение с постоянным угловым приращением:

# GenericTab_ShakeLabel
source: Shake power:
ru_ru: Сила дрожания:

# CDP_WindowSize
source: Select window size
ru_ru: Выберите размер окна

# MainTabControl_GenericTab
source: Generic
ru_ru: Основные

# ConcurrentDrawParameters_ProfileLabel
source: Profile:
ru_ru: Профиль:

# CDP_ProfileDefault
source: Default settings
ru_ru: Стандартные настройки

# CDP_ProfileSaved
source: Last saved settings
ru_ru: Последние сохранённые настройки

# CDP_ProfileError
source: Profile with the same name already exists or name is empty
ru_ru: Профиль с таким именем уже существует, или имя профиля отсутствует

# CDP_ProfileRemove
source: Remove selected profile?
ru_ru: Удалить выбранный профиль?

# HistoTab_SDDoubleWidthFlag
source: 2x width
ru_ru: 2x ширина

# MainTabControl_LogoTab
source: Logo
ru_ru: Лого

# CDP_LogoCenterText
source: Logo height: {0:S}% Center placement: X = {1:S}; Y = {2:S}
ru_ru: Высота лого: {0:S}% Расположение центра: X = {1:S}; Y = {2:S}

# LogoTab_LogoCenterButton
source: Center
ru_ru: По центру

# HelpKeysText
source: Use next hotkeys: • right mouse button or [Space] – get to settings window; • double left click or [R] – change colors of “polymorph” and “random” palettes; • mouse wheel – change FFT scale multiplier; • [Esc] – close the application or settings window; • [Enter] – apply changes in settings window; • [M] – cyclically change visualization mode; with [Shift] – backward; • [L] – turn logo on / off; • [P] – cyclically change palette; with [Shift] – backward; • [H] – cyclically change histogram range; with [Shift] – backward; • arrows keys – move visualization window; with [Ctrl] – to the edge of screen; • arrows keys with [Shift] – move logo; with [Ctrl] – to the edge of window; • [< ,] and [> .] – decrease and increase histogram rotation speed; with [Shift] – beats-dependent rotation; • [C] – move histogram to the center of window; with [Shift] – move logo; • [/ ?] – show this quick user manual; • [T] – switch “Always on top” flag; • [K] – increase shake effect power; with [Shift] – decrease it; • [I] – request for current settings info; • [S] – saving current visualization screen to image file; • [W] – switch “histogram swinging” flag; • [V] – switch “beats waves” flag; • [PageUp] and [PageDown] – change histogram field's height; with [Shift] – change logo height; • [E] – switch “extended cumulative effect” flag; • [F] – switch “reverse histogram range” flag
ru_ru: Используйте следующие горячие клавиши: • правая кнопка мыши или [Пробел] – открыть окно настроек; • двойной щелчок левой кнопкой мыши или [R] – изменить цвета «полиморфной» и «случайной» палитр; • колёсико мыши – изменить множитель значений БПФ; • [Esc] – закрыть окно приложения или настроек; • [Enter] – применить настройки в окне настроек; • [M] – циклически сменить режим визуализации; вместе с [Shift] – в обратном направлении; • [L] – включение / выключение лого; • [P] – циклически сменить палитру; вместе с [Shift] – в обратном направлении; • [H] – циклически сменить диапазон гистограммы; вместе с [Shift] – в обратном направлении; • стрелки – перемещение окна визуализации; вместе с [Ctrl] – к краю экрана; • стрелки вместе с [Shift] – перемещение логотипа; вместе с [Ctrl] – к краю окна; • [< ,] и [> .] – уменьшение и увеличение скорости вращения гистограммы; вместе с [Shift] – вращение в соответствии с бит-детектором; • [C] – переместить поле гистограммы в центр окна; вместе с [Shift] – переместить лого; • [/ ?] – показать это краткое руководство пользователя; • [T] – переключение флага «Поверх всех окон»; • [K] – увеличение силы эффекта дрожания; вместе с [Shift] – уменьшение; • [I] – запрос информации о текущих настройках; • [S] – сохранение текущего изображения визуализации в файл; • [W] – переключение флага «Качание гистограммы»; • [V] – переключение флага «Волны бит-детектора»; • [PageUp] и [PageDown] – изменение высоты поля гистограммы; вместе с [Shift] – изменение размера лого; • [E] – переключение флага «Расширенный кумулятивный эффект»; • [F] – переключение флага «Реверс диапазона гистограммы»

# CumulationTab_CEInfoLabel
source: (1 – no cumulative effect)
ru_ru: (1 – без кумулятивного эффекта)

# LogoTab_LogoInfoLabel
source: (0 – left (top), 1 – right (bottom), 0.5 – center)
ru_ru: (0 – слева (сверху), 1 – справа (снизу), 0.5 – по центру)

# CDP_BDNo
source: No beats detection
ru_ru: Бит-детектор отключён

# HistoTab_SwingingHistogramFlag
source: Swinging instead of rotating
ru_ru: Качание вместо вращения

# GenericTab_WithLogoFlag
source: Logo
ru_ru: Лого

# HistoTab_SGTopOffsetLabel
source: Offset from top:
ru_ru: Смещение:

# LogoTab_BeatWavesFlag
source: Beats waves
ru_ru: Волны бито́в

# MainTabControl_ParticlesTab
source: Particles
ru_ru: Объекты

# ParticlesTab_EnlargingCoeffLabel
source: Enlarging coeff.:
ru_ru: Коэфф. роста:

# ParticlesTab_ObjectsAccelerationLabel
source: Acceleration:
ru_ru: Ускорение:

# ParticlesTab_ObjectsCountLabel
source: Count:
ru_ru: Количество:

# ParticlesTab_ObjectsKeepTracksFlag
source: Keep tracks
ru_ru: Оставлять следы

# ParticlesTab_ObjectsMaxColor
source: Max. color
ru_ru: Макс. цвет

# ParticlesTab_ObjectsMinColor
source: Min. color
ru_ru: Мин. цвет

# ParticlesTab_ObjectsSizeLabel
source: Size range:
ru_ru: Разброс размеров:

# ParticlesTab_ObjectsSpeedLabel
source: Speed range:
ru_ru: Разброс скоростей:

# ParticlesTab_ObjectsTypeLabel
source: Type:
ru_ru: Тип:

# ParticlesTab_SidesCountLabel
source: Sides count:
ru_ru: Граней:

# ParticlesTab_SpeedFluctuationLabel
source: Speed fluctuation:
ru_ru: Дребезг скорости:

# ParticlesTab_StartupSideLabel
source: Start at:
ru_ru: Начинать с:

# CDP_FFTScaleLabel
source: FFT scale multiplier: {0:D}
ru_ru: Множитель значений БПФ: {0:D}

# HistoTab_HistoRotInitialAngleLabel
source: Initial angle:
ru_ru: Начальный угол:

# CumulationTab_ExtendedCumulation
source: Extended cumulative effect
ru_ru: Расширенный кумулятивный эффект

# HistoTab_ReverseFreqOrderFlag
source: Reverse histogram range
ru_ru: Развернуть диапазон гистограммы
